Revit 2024 API
BuiltInFailures.IlluminationFailures.RoomLightLossFactorWarning Property
 Estimated Illumination failed. Light Loss factor not set for lighting fixture.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RoomLightLossFactorWarning { get; }
Visual Basic
Public Shared ReadOnly Property RoomLightLossFactorWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RoomLightLossFactorWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.IlluminationFailures Class
Autodesk.Revit.DB Namespace